10/data/attachments/6259da0f456e9800.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Edgar_college_Friend_97556_2</nif:username>
            <nif:friendToBeRequested>soap_friends_6d553ce9-cb50-40df-a0db-649e302c6661</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>